-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 08 2022 г., 21:48
-- Версия сервера: 8.0.24
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `library`
--

-- --------------------------------------------------------

--
-- Структура таблицы `library_table`
--

CREATE TABLE `library_table` (
  `num` int NOT NULL,
  `codeNum` int NOT NULL,
  `new` tinyint(1) NOT NULL,
  `name` varchar(200) NOT NULL,
  `price` float DEFAULT '0',
  `publisher` varchar(100) NOT NULL,
  `pages` int NOT NULL,
  `form` varchar(100) DEFAULT 'No data',
  `publish_date` date DEFAULT NULL,
  `circulation` int NOT NULL,
  `topic` varchar(200) NOT NULL,
  `category` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `library_table`
--

INSERT INTO `library_table` (`num`, `codeNum`, `new`, `name`, `price`, `publisher`, `pages`, `form`, `publish_date`, `circulation`, `topic`, `category`) VALUES
(203, 44, 0, 'Відповіді на актуальні запитання щодо OS/2 Warp', 5, 'DiaSoft', 352, '60x84/16', '1996-03-20', 5000, 'Операційні системи', 'Інші операційні системи'),
(222, 235, 1, 'Інформаційні системи і структури даних', NULL, 'Києво-Могилянська академія', 288, '60x90/16', '2022-06-08', 400, 'Використання ПК в цілому', 'Інші книги'),
(191, 860, 0, 'Операційна система UNIX', 3.5, 'Видавнича група BHV', 395, '84x100/16', '1997-05-05', 5000, 'Операційні системи', 'UNIX'),
(226, 2154, 1, 'Сервер на основі операційної системи FreeBSD 6.1', NULL, 'Університет \"Україна\"', 216, '60x84/16', '2015-11-03', 500, 'Програмування', 'Інші операційні системи'),
(245, 2662, 0, 'Організація баз даних та знань', NULL, 'Вінниця:ВДПУ', 208, '60x90/16', '2001-10-10', 1000, 'Програмування', 'SQL'),
(432, 3322, 1, 'Математика та комбінаторика', 12, 'Херсонський державний університет', 130, '70x100/16', '2020-02-21', 3000, 'Математичні приклади комбінаторики', 'інші книги'),
(50, 3851, 1, 'Захист інформації, та безбека комп\'ютених систем', 26, 'DiaSoft', 480, '84x108/16', '2022-06-08', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(58, 3932, 0, 'Як   перетворити персональний комп\'ютер на вимірювальний комплекс', 7.65, 'ДМК', 144, '60x88/16', '1999-09-26', 5000, 'Використання ПК в цілому', 'Інші книги'),
(220, 4687, 0, 'Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів', 17.6, 'ДМК', 240, '70x100/16', '2000-02-03', 5000, 'Програмування', 'C&C++'),
(59, 4713, 0, 'Plug-ins. Додаткові програми для музичних програм', 11.41, 'ДМК', 144, '70x100/16', '2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги'),
(176, 4829, 0, 'Windows 2000 Proffesional крок за кроком з CD', 27.25, 'Эком', 320, '70x100/16', '2000-04-28', 5000, 'Операційні системи', 'Windows 2000'),
(210, 4982, 0, 'Мова програмування С. Лекції та вправи', 29, 'DiaSoft', 656, '84x108/16', '2000-07-12', 5000, 'Програмування', 'C&C++'),
(8, 4985, 0, 'Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид', 18.9, 'Вільямс', 288, '70x100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники'),
(2, 5110, 0, 'Апаратні засоби мультимедіа. Відеосистема РС', 15.51, 'Видавнича група BHV', 400, '70x100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники'),
(31, 5111, 0, 'Апаратні засоби мультимедіа. Відеосисема PC', 15.51, 'Видавнича група BHV', 400, '70x100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(20, 5127, 0, 'Автоматизація інженерно-графічних робіт', 11.58, 'Видавнича група BHV', 256, '70x100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(9, 5141, 0, 'Структури даних та алгоритми', 37.8, 'Вільямс', 384, '70x100/16', '2000-09-29', 5000, 'Використання ПК в цілому', 'Підручники'),
(188, 5170, 0, 'Linux версії', 24.43, 'ДМК', 346, '70x100/16', '2000-09-29', 5000, 'Операційні системи', 'Linux'),
(206, 5176, 0, 'Windows ME. Супутник користувача', 12.76, 'Видавнича група BHV', 306, NULL, '2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи'),
(46, 5199, 0, 'Залізо IMB 2001', 30.07, 'МикроАрт', 368, '70x100/16', '2000-02-12', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(175, 5217, 0, 'Windows ME. Найновіші версії програм', 16.57, 'Триумф', 320, '70x100/16', '2000-08-25', 5000, 'Операційні системи', 'Windows 2000'),
(209, 5462, 0, 'Мова програмування С++. Лекції та вправи', 29, 'DiaSoft', 656, '84x108/16', '2000-12-12', 5000, 'Програмування', 'C&C++'),
(247, 5641, 1, 'Організація баз даних та знань', NULL, 'Видавнича група BHV', 384, '70x100/16', '2018-07-25', 5000, 'Програмування', 'SQL'),
(225, 8746, 1, 'Бази даних в інформаційних системах', NULL, 'Університет \"Україна\"', 418, '60x84/16', '2018-07-25', 100, 'Програмування', 'SQL');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `library_table`
--
ALTER TABLE `library_table`
  ADD PRIMARY KEY (`codeNum`),
  ADD KEY `index_name` (`name`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
